#!/usr/bin/perl
print "Content-type: text/html\n\n";
print "<HTML><BODY><PRE>";
print 6 ^ 3; #110 & 011。結果：5（101）
print "\n";
print "6" & "b"; #00110110 & 01100010
#（両方とも文字列なので文字列としてビットごとに比較）。結果："（00100010）
print "\n";
print "aa" & "ab"; #01100001 01100001 & 01100001 01100010
#結果：a`（01100001 01100000）
print "\n";
print ~6; #00000000000000000000000000000110のビット否定。結果：4294967289
print "\n";
print 5 << 2; #左2ビットシフト。5 * 2 * 2。結果：20
print "\n";
print 5 >> 1; #右1ビットシフト。00000101→00000010。結果：2
print "</PRE></BODY></HTML>";
